app/Controllers/UserController.php

SELECT *
FROM `user`
---
    public function index()
    {
        $isAdmin = $this->checkLogin();
        if(!$isAdmin) { return redirect()->to(base_url('layout/login')); }

        $model = new UserModel();
        $notifikasiModel = new NotifikasiModel();
        $data['users'] = $model->findAll();