app/Models/ModelUser.php

SELECT *
FROM `user`
WHERE `username` = 'Okta'
AND `password` = 'fddb5ebe00d8efcb1bdfc3dbb4faae12'
 LIMIT 1
---
    public function login($username, $password)
    {
        return $this->where(['username' => $username, 'password' => $password])->first();